# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Flávio Martins

### Grupo 25
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1103540 Gonçalo Alves</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1102908 Luana Ferraz</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist1103555 Ricardo Pereira</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- Customer(<u>cust_no</u>, name, email, phone, address)
	- UNIQUE(email)
- Order(<u>order_no</u>, cust_no, date)
	- Cust_no: FK(Customer) NOT NULL
- Sale(<u>order_no</u>)
	- order_no: FK(Order)
- pay(<u>order_no</u>, cust_no)
	- order_no: FK(Sale)
	- cust_no: FK(Customer)
- Employee(<u>ssn</u>, TIN, bdate, name)
	- UNIQUE(TIN)
- process(<u>ssn</u>, <u>order_no</u>)
	- ssn: FK(Employee)
	- order_no: FK(Order)
- Department(<u>name</u>)
- Workplace(<u>address</u>, lat, long)
	- UNIQUE(lat, long)
- works(<u>ssn</u>, <u>name</u>, <u>address</u>)
	- ssn: FK(Employee)
	- name: FK(Department)
	- address: FK(Workplace)
- Office(<u>address</u>)
	- address: FK(Workplace)
- Warehouse(<u>address</u>)
	- address: FK(Workplace)
- Product(<u>sku</u>, name, description, price, ean)
	- (price >= 0)
- contains(<u>order_no</u>, <u>sku</u>, qty) 
	- order_no: FK(Order)
	- sku: FK(Product)
	- (qty > 0)
- Supplier(<u>TIN</u>, name, address)
- **supply-contract(<u>TIN</u>, sku, date)**
	- **TIN: FK(Supplier)**
	- **sku: FK(Product) NOT NULL**
- delivery(<u>TIN</u>, <u>address</u>)
	- TIN: FK(**supply-contract**)
	- address: FK(Warehouse)

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

- IC-1: Any element `order_no` referenced in `pay` must have the same `cust_no` in both relations `pay` and `Order`;
    - **NOTE:** this Restriction is the equivalent of the IC-1 restriction in the Entity-Relationship diagram
- IC-2: Any `order_no` from entity `Order` must be referenced in relation `contains`;
- IC-3: `bdate` must be earlier than the current date;
- IC-4: Any `sku` from entity `Product` must be referenced in **entity `supply-contract`**;
- **IC-5: Any `TIN` from entity `Supplier` must be referenced once in entity `supply-contract`;**
- IC-6: Any `ssn` from entity `Employee` must be referenced in relation `works`;

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{cust.name} \big((Customer) \bowtie_{o.cust\_no = cust.cust\_no} (Order) \bowtie_{o.order\_no = cont.order\_no \space \wedge \space o.date \ge "01-01-2023" \space \wedge \space o.date \le "12-31-2023"} (contains) \bowtie_{cont.sku=p.sku} \big( \sigma_{price>50} (Product) \big) \big)$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$\Pi_{e.name} \big( \sigma_{o.date \ge "01-01-2023" \space \wedge \space o.date \le "01-31-2023"} (Order) \bowtie_{o.order\_no = p.order\_no} (process) \bowtie_{p.ssn = e.ssn} (Employee) \bowtie_{e.ssn = w.ssn} (works) \bowtie_{w.address = wh.address} (Warehouse) \big) - \Pi_{e.name} \big(Employee \bowtie_{e.ssn = w.ssn} (works) \bowtie_{w.address = of.address} (Office) \big)$

3. Indique o nome do produto mais vendido;

$T \leftarrow \big( _{sku} G_{sum(qty) \rightarrow qty\_total} (contains) \bowtie_{c.sku=p.sku} (Product) \big)$

$\Pi_{name} \big( Product \bowtie_{p.sku = t.sku} T \bowtie G_{max(qty\_total)} (T) \big)$

4. Indique o valor total de cada venda realizada.

$ _{order\_no} G_{sum(price \times qty)} \big( Product \bowtie_{p.sku = c.sku} contains \bowtie_{c.order\_no = o.order\_no} Order \big) $

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

There's a new jupysql version available (0.7.6), you're running 0.7.4. To upgrade: pip install jupysql --upgrade

In [2]:
%%sql

-- DROP TABLES
DROP TABLE if EXISTS delivery CASCADE;
DROP TABLE if EXISTS supply_contract;
DROP TABLE if EXISTS supplier CASCADE;
DROP TABLE if EXISTS contains CASCADE;
DROP TABLE if EXISTS product CASCADE;
DROP TABLE if EXISTS warehouse CASCADE;
DROP TABLE if EXISTS office CASCADE;
DROP TABLE if EXISTS works CASCADE;
DROP TABLE if EXISTS workplace CASCADE;
DROP TABLE if EXISTS department CASCADE;
DROP TABLE if EXISTS process CASCADE;
DROP TABLE if EXISTS employee CASCADE;
DROP TABLE if EXISTS pay CASCADE;
DROP TABLE if EXISTS sale CASCADE;
DROP TABLE if EXISTS order_ CASCADE;
DROP TABLE if EXISTS customer CASCADE;

-- CREATE TABLES
CREATE TABLE customer(
    cust_no BIGINT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(255),
    phone NUMERIC (9),
    address VARCHAR(255),
    UNIQUE(email)
);
    
CREATE TABLE order_(
    order_no BIGINT PRIMARY KEY,
    cust_no BIGINT NOT NULL,
    date DATE,
    FOREIGN KEY(cust_no) REFERENCES customer
);

CREATE TABLE sale(
    order_no BIGINT PRIMARY KEY,
    FOREIGN KEY(order_no) REFERENCES order_
);


CREATE TABLE pay(
    order_no BIGINT REFERENCES sale,
    cust_no BIGINT REFERENCES customer,
    PRIMARY KEY(order_no)
);

CREATE TABLE employee(
    ssn NUMERIC(11) PRIMARY KEY,
    TIN VARCHAR(9),
    bdate DATE,
    name VARCHAR(100),
    UNIQUE(TIN)
);

CREATE TABLE process(
    ssn NUMERIC(11) REFERENCES employee,
    order_no BIGINT REFERENCES order_,
    PRIMARY KEY(ssn, order_no)
);

CREATE TABLE department(
    name VARCHAR(100),
    PRIMARY KEY(name)
);

CREATE TABLE workplace(
    address VARCHAR(255),
    lat DECIMAL(8, 6),
    long DECIMAL(9, 6),
    PRIMARY KEY(address),
    UNIQUE(lat, long)
);


CREATE TABLE works(
    ssn NUMERIC(11) REFERENCES employee,
    name VARCHAR(100) REFERENCES department,
    address VARCHAR(255) REFERENCES workplace,
    PRIMARY KEY(ssn, name, address)
);
    
CREATE TABLE office(
    address VARCHAR(255) REFERENCES workplace
);

CREATE TABLE warehouse(
    address VARCHAR(255) REFERENCES workplace,
    PRIMARY KEY(address)
);

CREATE TABLE product(
    sku VARCHAR(8) NOT NULL,
    name VARCHAR(100),
    description VARCHAR(255),
    price DECIMAL(10, 2) CHECK (price > 0),
    ean NUMERIC(12),
    PRIMARY KEY(sku)
);

CREATE TABLE contains(
    order_no BIGINT REFERENCES order_,
    sku VARCHAR(8) REFERENCES product,
    qty INTEGER NOT NULL CHECK (qty > 0),
    PRIMARY KEY(order_no, sku)
);

CREATE TABLE Supplier(
    TIN VARCHAR(9),
    name VARCHAR(100),
    address VARCHAR(255),
    PRIMARY KEY(TIN)
);

CREATE TABLE supply_contract(
    TIN VARCHAR(9) REFERENCES Supplier,
    sku VARCHAR(8) NOT NULL REFERENCES Product,
    date DATE,
    PRIMARY KEY(TIN)
);

CREATE TABLE delivery(
    TIN VARCHAR(9) REFERENCES supply_contract,
    address VARCHAR(255) REFERENCES warehouse,
    PRIMARY KEY(TIN, address)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [3]:
%%sql

-- INSERT VALUES
INSERT INTO customer VALUES (1234, 'John', 'john@email.com', 919191919, 'Rua Vasco Paisana n10');
INSERT INTO customer VALUES (1235, 'Mary', 'mary@email.com', 919191555, 'Rua Vasco da Gama n18');
INSERT INTO customer VALUES (1236, 'Paul', 'paul@email.com', 919191444, 'Rua Santa Maria n79');
INSERT INTO customer VALUES (1237, 'Emily', 'emily@email.com', 919191333, 'Avenida 2 de agosto n46');

INSERT INTO order_ VALUES (0000, 1236, '2022-12-09');
INSERT INTO order_ VALUES (1111, 1234, '2023-01-20');
INSERT INTO order_ VALUES (2222, 1235, '2023-01-15');
INSERT INTO order_ VALUES (3333, 1234, '2023-01-26');
INSERT INTO order_ VALUES (4444, 1237, '2023-01-09');

INSERT INTO sale VALUES (1111);
INSERT INTO sale VALUES (4444);

INSERT INTO pay VALUES (1111, 1234);
INSERT INTO pay VALUES (4444, 1237);

INSERT INTO product VALUES ('12345678', 'box', '5cm/7cm/12cm, wooden box', '15.0', 560123456789);
INSERT INTO product VALUES ('12345679', 'pen', 'black ink pen', '37.0', 560123456780);
INSERT INTO product VALUES ('12345670', 'mirror', '170cm/230cm/5cm silver mirror', '58.0', 560123456781);
INSERT INTO product VALUES ('12345671', 'sofa', '2-seat sofa, Vissle beige', '199.0', 560123456782);
INSERT INTO product VALUES ('12345672', 'table', 'table, black, 110x67cm', '50.0', 560123456783);

INSERT INTO contains VALUES (1111, '12345678', 2);
INSERT INTO contains VALUES (1111, '12345670', 1);
INSERT INTO contains VALUES (2222, '12345670', 1);
INSERT INTO contains VALUES (2222, '12345671', 2);
INSERT INTO contains VALUES (2222, '12345672', 1);
INSERT INTO contains VALUES (3333, '12345679', 10);
INSERT INTO contains VALUES (3333, '12345678', 3);
INSERT INTO contains VALUES (0000, '12345670', 3);
INSERT INTO contains VALUES (4444, '12345672', 2);

INSERT INTO employee VALUES (12131415161, '258258258', '1997-04-26', 'Jane Doe');
INSERT INTO employee VALUES (12131415162, '258258321', '1990-07-21', 'Mark Cliff');
INSERT INTO employee VALUES (12131415163, '258258456', '1998-06-26', 'Tom Fizz');
INSERT INTO employee VALUES (12131415164, '258258789', '1995-10-12', 'Catherine Stuart');
INSERT INTO employee VALUES (12131415165, '258258987', '1999-11-04', 'Maggie Green');

INSERT INTO process VALUES (12131415161, 0000);
INSERT INTO process VALUES (12131415162, 1111);
INSERT INTO process VALUES (12131415163, 2222);
INSERT INTO process VALUES (12131415161, 3333);
INSERT INTO process VALUES (12131415164, 4444);

INSERT INTO department VALUES ('Departamento de Gestao de Encomendas');
INSERT INTO department VALUES ('Departamento de Recursos Humanos');

INSERT INTO workplace VALUES ('Estrada da Avessada', 38.927682, -9.257470);
INSERT INTO workplace VALUES ('Avenida da Republica', 38.735465, -9.145027);
INSERT INTO workplace VALUES ('Pacifico', 38.729919, -9.073064);

INSERT INTO works VALUES (12131415161, 'Departamento de Gestao de Encomendas', 'Estrada da Avessada');
INSERT INTO works VALUES (12131415162, 'Departamento de Gestao de Encomendas', 'Estrada da Avessada');
INSERT INTO works VALUES (12131415163, 'Departamento de Gestao de Encomendas', 'Avenida da Republica');
INSERT INTO works VALUES (12131415161, 'Departamento de Gestao de Encomendas', 'Pacifico');
INSERT INTO works VALUES (12131415164, 'Departamento de Gestao de Encomendas', 'Avenida da Republica');
INSERT INTO works VALUES (12131415165, 'Departamento de Gestao de Encomendas', 'Estrada da Avessada');

INSERT INTO warehouse VALUES ('Avenida da Republica');
INSERT INTO warehouse VALUES ('Estrada da Avessada');

INSERT INTO office VALUES ('Estrada da Avessada');
INSERT INTO office VALUES ('Pacifico');

INSERT INTO supplier VALUES ('264893401', 'Wooden Space', 'Rua 30 de Fevereiro'); -- Porque nao :) 
INSERT INTO supplier VALUES ('268970012', 'BIC', 'Zona Industrial da Venda do Pinheiro');
INSERT INTO supplier VALUES ('264108994', 'Unividros', 'Ponte do Rol');
INSERT INTO supplier VALUES ('263329855', 'IKEA', 'Zona Industrial de Alfragide');
INSERT INTO supplier VALUES ('265977103', 'Movixira Portugal', 'Alverca do Ribatejo');

INSERT INTO supply_contract VALUES ('264893401', '12345678', '2021-09-01');
INSERT INTO supply_contract VALUES ('268970012', '12345679', '2022-06-01');
INSERT INTO supply_contract VALUES ('264108994', '12345670', '2023-02-01');
INSERT INTO supply_contract VALUES ('263329855', '12345671', '2016-01-01');
INSERT INTO supply_contract VALUES ('265977103', '12345672', '2021-07-01');

INSERT INTO delivery VALUES ('264893401', 'Estrada da Avessada');
INSERT INTO delivery VALUES ('268970012', 'Estrada da Avessada');
INSERT INTO delivery VALUES ('264108994', 'Avenida da Republica');
INSERT INTO delivery VALUES ('263329855', 'Avenida da Republica');
INSERT INTO delivery VALUES ('265977103', 'Avenida da Republica');

*  postgresql://db:***@postgres/db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [4]:
%%sql

SELECT 
    DISTINCT customer.name
FROM 
    customer JOIN order_ USING (cust_no) JOIN contains USING (order_no) 
    JOIN product USING (sku)
WHERE 
    EXTRACT(YEAR FROM date)=2023
    AND price > 50;

*  postgresql://db:***@postgres/db
2 rows affected.

[('John',), ('Mary',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [5]:
%%sql

SELECT 
    DISTINCT e.name
FROM 
    employee AS e, customer AS c, order_ AS o, process AS p, works AS w, 
    warehouse AS wh
WHERE 
    EXTRACT(YEAR FROM o.date)=2023
    AND EXTRACT(MONTH FROM o.date)=01
    AND o.order_no = p.order_no
    AND p.ssn = e.ssn
    AND e.ssn = w.ssn
    AND w.address = wh.address
EXCEPT
SELECT 
    DISTINCT e.name
FROM 
    employee AS e, works AS w, office AS of 
WHERE            
    e.ssn = w.ssn
    AND w.address = of.address;

*  postgresql://db:***@postgres/db
2 rows affected.

[('Tom Fizz',), ('Catherine Stuart',)]

3. Indique o nome do produto mais vendido;

In [6]:
%%sql

SELECT name FROM product JOIN contains USING (sku)
GROUP BY sku HAVING SUM(qty) >= ALL (
    SELECT SUM(qty)
    FROM contains 
    GROUP BY sku
);

*  postgresql://db:***@postgres/db
1 rows affected.

[('pen',)]

4. Indique o valor total de cada venda realizada.

In [7]:
%%sql

SELECT 
    order_no, 
    SUM(price * qty) AS total_price 
FROM 
    order_ JOIN contains USING (order_no) JOIN product USING (sku)
GROUP BY order_no;

*  postgresql://db:***@postgres/db
5 rows affected.

[(4444, Decimal('100.00')),
 (0, Decimal('174.00')),
 (2222, Decimal('506.00')),
 (3333, Decimal('415.00')),
 (1111, Decimal('88.00'))]